---
kind: other
id: Properties.T:Autodesk.Revit.DB.DetailCurve
source: html/e94bb4ad-8846-a8c8-4825-3563706f7753.htm
---
# DetailCurve Properties

The id of the assembly instance to which the element belongs.